test/artillery/docker-test/stock-get.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000/warehouse
  phases:
    - duration: 10
      arrivalRate: 25
      rampTo: 70
      name: "Case: 1 virtual users to 10 in 15 seconds"
scenarios:
  - flow:
    - loop:
      - log: "Get stock"
      - get: 
          url: "/stock/1"
      count: 2
# artillery run ./test/artillery/stock-get.yml